app/Controllers/Admin.php

SELECT *
FROM `sewa`
WHERE `tgl_sewa` LIKE '%2022-01%' ESCAPE '!'
SELECT SUM(`total_biaya`) AS `total_biaya`
FROM `sewa`
WHERE `tgl_sewa` LIKE '%2022-01%' ESCAPE '!'
SELECT COUNT(`kd_lapangan`) AS `kd_lapangan`
FROM `sewa`
WHERE `kd_lapangan` = 1
AND  `tgl_sewa` LIKE '%2022-01%' ESCAPE '!'
SELECT COUNT(`kd_lapangan`) AS `kd_lapangan`
FROM `sewa`
WHERE `kd_lapangan` = 2
AND  `tgl_sewa` LIKE '%2022-01%' ESCAPE '!'
SELECT COUNT(`kd_lapangan`) AS `kd_lapangan`
FROM `sewa`
WHERE `kd_lapangan` = 3
AND  `tgl_sewa` LIKE '%2022-01%' ESCAPE '!'
---
    public function genlaporan(){
        date_default_timezone_set('asia/jakarta');
        $tahun = $this->request->getPost('tahun');
        $bulan = $this->request->getPost('bulan');
        if ($bulan < 10) {
            $ck = $tahun.'-0'.$bulan;
        }else{
            $ck = $tahun.'-'.$bulan;
        }


        $db      = \Config\Database::connect();

        $query = $db->table('sewa')->like('tgl_sewa', $ck, 'both')->get();
        $sum = $db->table('sewa')->selectSum('total_biaya')->like('tgl_sewa', $ck, 'both')->get()->getResult();
        $lap1 = $db->table('sewa')->selectCount('kd_lapangan')->where('kd_lapangan',1)->like('tgl_sewa', $ck, 'both')->get()->getResult();
        $lap2 = $db->table('sewa')->selectCount('kd_lapangan')->where('kd_lapangan',2)->like('tgl_sewa', $ck, 'both')->get()->getResult();
        $lap3 = $db->table('sewa')->selectCount('kd_lapangan')->where('kd_lapangan',3)->like('tgl_sewa', $ck, 'both')->get()->getResult();