app/Models/Model_LR.php

    public function getdata($data = false)
    {
        if ($data === false) {
            return $this->db->table('sewa')->join('lapangan', 'lapangan.kd_lapangan = sewa.kd_lapangan')->join('user', 'user.kd_user = sewa.kd_user')->get()->getResult();
---
SELECT *
FROM `sewa`
JOIN `lapangan` ON `lapangan`.`kd_lapangan` = `sewa`.`kd_lapangan`
JOIN `user` ON `user`.`kd_user` = `sewa`.`kd_user`

    public function getdatauser($data = false)
    {
        if ($data === false) {
            return $this->db->table('user')->getWhere(['level'=>2])->getResult();
---
SELECT *
FROM `user`
WHERE `level` = 2